analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32662/Include/gcr_regs.h
#define MXC_F_GCR_ECCCED_FLASH1_POS                    5 /**< ECCCED_FLASH1 Position */
#define MXC_F_GCR_ECCCED_FLASH1                        ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_FLASH1_POS)) /**< ECCCED_FLASH1 Mask */

/**@} end of group GCR_ECCCED_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECCIE GCR_ECCIE
 * @brief    ECC IRQ Enable Register
 * @{
 */
#define MXC_F_GCR_ECCIE_RAM0_1_POS                     0 /**< ECCIE_RAM0_1 Position */
#define MXC_F_GCR_ECCIE_RAM0_1                         ((uint32_t)(0x1UL << MXC_F_GCR_ECCIE_RAM0_1_POS)) /**< ECCIE_RAM0_1 Mask */

#define MXC_F_GCR_ECCIE_RAM2_POS                       1 /**< ECCIE_RAM2 Position */
#define MXC_F_GCR_ECCIE_RAM2                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCIE_RAM2_POS)) /**< ECCIE_RAM2 Mask */

#define MXC_F_GCR_ECCIE_RAM3_POS                       2 /**< ECCIE_RAM3 Position */
#define MXC_F_GCR_ECCIE_RAM3                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCIE_RAM3_POS)) /**< ECCIE_RAM3 Mask */

#define MXC_F_GCR_ECCIE_ICC0_POS                       3 /**< ECCIE_ICC0 Position */
#define MXC_F_GCR_ECCIE_ICC0                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCIE_ICC0_POS)) /**< ECCIE_ICC0 Mask */

#define MXC_F_GCR_ECCIE_FLASH0_POS                     4 /**< ECCIE_FLASH0 Position */
#define MXC_F_GCR_ECCIE_FLASH0                         ((uint32_t)(0x1UL << MXC_F_GCR_ECCIE_FLASH0_POS)) /**< ECCIE_FLASH0 Mask */

#define MXC_F_GCR_ECCIE_FLASH1_POS                     5 /**< ECCIE_FLASH1 Position */
#define MXC_F_GCR_ECCIE_FLASH1                         ((uint32_t)(0x1UL << MXC_F_GCR_ECCIE_FLASH1_POS)) /**< ECCIE_FLASH1 Mask */

/**@} end of group GCR_ECCIE_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECCADDR GCR_ECCADDR
 * @brief    ECC Error Address Register
 * @{
 */
#define MXC_F_GCR_ECCADDR_ERRADDR_POS                  0 /**< ECCADDR_ERRADDR Position */
#define MXC_F_GCR_ECCADDR_ERRADDR                      ((uint32_t)(0xFFFFFFFFUL << MXC_F_GCR_ECCADDR_ERRADDR_POS)) /**< ECCADDR_ERRADDR Mask */

/**@} end of group GCR_ECCADDR_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32662_INCLUDE_GCR_REGS_H_
